system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(0 0 0)//0
(5.76 0 0)//1
(5.76 0.06 0)//2
(0 0.06 0)//3
(0 0 0.005)//4
(5.76 0 0.005)//5
(5.76 0.06 0.005)//6
(0 0.06 0.005)//7
(8.64 0 0)//8
(8.64 0.06 0)//9
(8.64 0.06 0.005)//10
(8.64 0 0.005)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (576 15  1) simpleGrading (1 1 1)
hex (1 8 9 2 5 11 10 6) (288 15 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  inlet
  {
  	type patch;
  	faces
  	(
  		(0 3 4 7)
  	);
  }

  outlet
  {
  	type patch;
  	faces
  	(
         (8 9 10 11)
  	);
  }

  wall1
  {
  	type wall;
  	faces
  	(
        (2 3 7 6)
  	);
  }

  wall2
  {
    type wall;
    faces
    (
      (2 9 10 6)
    );
  }

  front
  {
      type empty;
      faces
      (
        (0 1 2 3)
        (1 8 9 2)
      );
  }

  // front2
  // {
  //   type empty;
  //   faces
  //   (
  //
  //   );
  // }

  back
  {
    type empty;
    faces
    (
        (4 5 6 7)
        (5 11 10 6)
    );
  }
  //
  // back2
  // {
  //   type empty;
  //   faces
  //   (
  //
  //   );
  // }
);

mergePatchPairs
(
);

// ************************************************************************* //
