0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  inlet
  {
      type             oscillatingSwirlInletVelocity;
      freq             10;
      Umax             2;
      rpm              200;
      cavityRadius     (0 0.06 0);
      axis             (1 0 0);
      y                (0 1 0);
      value             uniform (0 0 0);
  }
  // {
  //      type oscillatingSwirlInletVelocity;
  //      value uniform (1 0 0);
  // }
  outlet
  {
      type zeroGradient;
  }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
