0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   /* floor
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    ceiling
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    fixedWalls
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
*/
   cavityRight
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    DIAPHRAGM
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    cavityTop
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    orificeRight
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    domainBottom
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    domainRight
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    domainTop
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
        
}


// ************************************************************************* //
