0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
  wall
    {
      type fixedValue;
      value uniform 350;

    }

    inlet
    {
      type fixedValue;
      value uniform 300;
    }

    outlet
    {
      type zeroGradient;
    }

    back
    {
        type          wedge;
    }

    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
