0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
 cavityRight
    {
        type            fixedValue;
        value           uniform 0;
    }
    DIAPHRAGM
    {
        type            fixedValue;
        value           uniform 0;
        
       /* type            fixedValue;
        value           uniform (0 1 0);*/
    }
    cavityTop
    {
        type            fixedValue;
        value           uniform 0;
    }
    orificeRight
    {
        type            fixedValue;
        value           uniform 0;
    }
    domainBottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    domainRight
    {
        type            zeroGradient;
    }
    domainTop
    {
        type            fixedValue;
        value           uniform 0;
    }
    /*axis
    {
        type            empty;
    }*/
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
