0.org/pointMotionU
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;
    class pointVectorField;
    object pointMotionU;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  wall
    {
        type myOscillatingVelocity;
        amplitude  0;
        omega 1; //[rad/sec]
        rc    0;
        value uniform (0 0 0);
    }

    inlet
    {
      type fixedValue;
      value uniform (0 0 0);
    }

    outlet
    {
      type fixedValue;
      value uniform (0 0 0);
    }

    back
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
