system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          GAMG;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration off;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;

        tolerance        0.02;
        relTol           0;
    }

    p
    {
        $pcorr;
        tolerance       1e-04;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-04;
        relTol          0;
    }
   /* p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pcorr
    {
        $p
        tolerance       0.02;
        relTol          0;
    }*/

    /*U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }*/

  "(U|T)"
  {
    solver PBiCG;// BiCGStab;
    preconditioner DILU;
    tolerance 1e-4;
    relTol          0.01;
  }

    "(UFinal|TFinal)"
    {
    solver PBiCG;// BiCGStab;
    preconditioner DILU;
    tolerance 1e-4;
    relTol          0;
    }

/*    cellMotionUx
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }*/

    cellMotionU
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0;
    };
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors    50;	//pressure-momentum correction. iterations is one time step
    nCorrectors         2;	//pressure correction interations for one outer loop
    nNonOrthogonalCorrectors 3;
    pRefCell            0;
    pRefValue           0;

	residualControl
	{}

}

relaxationFactors
{
    equations
    {
        U     0.7;
        p     0.3;
        //"U.*"           0.9;
    }
}
}
// ************************************************************************* //
