system/probesDict
l/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fields to be probed. runTime modifiable!
fields
(
     NusseltNumber
);

// Locations to be probed. runTime modifiable!
probeLocations
(
(  0.1      0.1       0.00000000     )
(  0.200000003      0.1       0.00000000     )
(  0.300000012      0.1       0.00000000     )
(  0.400000006      0.1       0.00000000     )
(  0.500000000      0.1       0.00000000     )
(  0.600000024      0.1       0.00000000     )
(  0.700000048      0.1       0.00000000     )
(  0.800000072      0.1       0.00000000     )
(  0.900000095      0.1       0.00000000     )
(   1.00000012      0.1       0.00000000     )
(   1.10000014      0.1       0.00000000     )
(   1.20000017      0.1       0.00000000     )
(   1.30000019      0.1       0.00000000     )
(   1.40000021      0.1       0.00000000     )
(   1.50000024      0.1       0.00000000     )
(   1.60000026      0.1       0.00000000     )
(   1.70000029      0.1       0.00000000     )
(   1.80000031      0.1       0.00000000     )
(   1.90000033      0.1       0.00000000     )
(   2.00000024      0.1       0.00000000     )
(   2.10000014      0.1       0.00000000     )
(   2.20000005      0.1       0.00000000     )
(   2.29999995      0.1       0.00000000     )
(   2.39999986      0.1       0.00000000     )
(   2.49999976      0.1       0.00000000     )
(   2.59999967      0.1       0.00000000     )
(   2.69999957      0.1       0.00000000     )
(   2.79999948      0.1       0.00000000     )
(   2.89999938      0.1       0.00000000     )
(   2.99999928      0.1       0.00000000     )
(   3.09999919      0.1       0.00000000     )
(   3.19999909      0.1       0.00000000     )
(   3.29999900      0.1       0.00000000     )
(   3.39999890      0.1       0.00000000     )
(   3.49999881      0.1       0.00000000     )
(   3.59999871      0.1       0.00000000     )
(   3.69999862      0.1       0.00000000     )
(   3.79999852      0.1       0.00000000     )
(   3.89999843      0.1       0.00000000     )
(   3.99999833      0.1       0.00000000     )
(   4.09999847      0.1       0.00000000     )
(   4.19999838      0.1       0.00000000     )
(   4.29999828      0.1       0.00000000     )
(   4.39999819      0.1       0.00000000     )
(   4.49999809      0.1       0.00000000     )
(   4.59999800      0.1       0.00000000     )
(   4.69999790      0.1       0.00000000     )
(   4.79999781      0.1       0.00000000     )
(   4.89999771      0.1       0.00000000     )
(   4.99999762      0.1       0.00000000     )
(   5.09999752      0.1       0.00000000     )
(   5.19999743      0.1       0.00000000     )
(   5.29999733      0.1       0.00000000     )
(   5.39999723      0.1       0.00000000     )
(   5.49999714      0.1       0.00000000     )
(   5.59999704      0.1       0.00000000     )
(   5.69999695      0.1       0.00000000     )
(   5.79999685      0.1       0.00000000     )
(   5.89999676      0.1       0.00000000     )
(   5.99999666      0.1       0.00000000     )
(   6.09999657      0.1       0.00000000     )
(   6.19999647      0.1       0.00000000     )
(   6.29999638      0.1       0.00000000     )
(   6.39999628      0.1       0.00000000     )
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
